pepeangell5/CYBERDECK-MINI-ESP32-V2/src/MenuSystem.cpp
#include "MenuSystem.h"

#include <string.h>

#include "PepeDraw.h"
#include "Pins.h"
#include "Input.h"
#include "SoundUtils.h"

#include "WifiScanner.h"
#include "ThreatMonitor.h"
#include "WifiAudit.h"
#include "RadioScanner.h"
#include "RadioJammer.h"
#include "NRFDiagnostics.h"
#include "PacketMonitor.h"
#include "SettingsMenu.h"
#include "SystemInfo.h"
#include "BLEAudit.h"
#include "BLEScanner.h"
#include "BLESpam.h"
#include "BTDisruptor.h"
#include "bt_jammer.h"
#include "BeaconSpam.h"
#include "Deauther.h"
#include "EvilPortal.h"
#include "Screensaver.h"
#include "ProbeSniffer.h"
#include "Karma.h"
#include "ClockWeather.h"
#include "About.h"
#include "PeripheralTools.h"

static constexpr uint16_t MOD_BG     = TFT_BLACK;
static constexpr uint16_t MOD_TEXT   = TFT_WHITE;
static constexpr uint16_t MOD_LINE   = TFT_WHITE;
static constexpr uint16_t MOD_INVERT = TFT_BLACK;
static constexpr uint16_t MOD_GLOW   = 0x07FF;
static constexpr uint16_t MOD_GLOW_2 = 0x03EF;

static constexpr int MENU_TOP = 42;
static constexpr int ROW_H    = 31;
static constexpr int ROW_X    = 8;
static constexpr int ROW_W    = 152;
static constexpr int ROW_BOX_H = 27;
static constexpr int PREVIEW_X = 168;
static constexpr int PREVIEW_Y = 42;
static constexpr int PREVIEW_W = 144;
static constexpr int PREVIEW_H = 156;

static void handlerWifi();
static void handlerRadio();
static void handlerBT();
static void handlerMonitor();
static void handlerSystem();

static const MainMenuEntry MAIN_ENTRIES[] = {
    { "WIFI",      "Scanner / portal", ICON_WIFI,      handlerWifi    },
    { "RADIO",     "Dual NRF tools",   ICON_RADIO,     handlerRadio   },
    { "BLUETOOTH", "BLE lab modes",    ICON_BLUETOOTH, handlerBT      },
    { "MONITOR",   "Live packets",     ICON_MONITOR,   handlerMonitor },
    { "SYSTEM",    "Device config",    ICON_SYSTEM,    handlerSystem  },
};

static const int MAIN_COUNT = sizeof(MAIN_ENTRIES) / sizeof(MainMenuEntry);
static int currentEntry = 0;

static constexpr int SUBMENU_STATE_SLOTS = 16;

struct SubMenuState {
    const char* title;
    int cursor;
    int scrollOffset;
};

static SubMenuState subMenuStates[SUBMENU_STATE_SLOTS] = {};
static int nextSubMenuStateSlot = 0;

static SubMenuState* stateForSubMenu(const char* title) {
    for (int i = 0; i < SUBMENU_STATE_SLOTS; i++) {
        if (subMenuStates[i].title && strcmp(subMenuStates[i].title, title) == 0) {
            return &subMenuStates[i];
        }
    }

    for (int i = 0; i < SUBMENU_STATE_SLOTS; i++) {
        if (!subMenuStates[i].title) {
            subMenuStates[i] = { title, 0, 0 };
            return &subMenuStates[i];
        }
    }

    SubMenuState* state = &subMenuStates[nextSubMenuStateSlot];
    nextSubMenuStateSlot = (nextSubMenuStateSlot + 1) % SUBMENU_STATE_SLOTS;
    *state = { title, 0, 0 };
    return state;
}

static void drawBitmapCentered(int y, const String& text, uint16_t color,
                               int size, FontType font) {
    int w = getTextWidth(text, size, font);
    int x = (320 - w) / 2;
    if (x < 0) x = 0;

    if (font == FONT_BIG) drawStringBig(x, y, text, color, size);
    else drawStringCustom(x, y, text, color, size);
}

static void drawBitmapCenteredIn(int x0, int width, int y, const String& text,
                                 uint16_t color, int size, FontType font) {
    int w = getTextWidth(text, size, font);
    int x = x0 + (width - w) / 2;
    if (x < x0) x = x0;

    if (font == FONT_BIG) drawStringBig(x, y, text, color, size);
    else drawStringCustom(x, y, text, color, size);
}

static void drawBitmapRight(int xRight, int y, const String& text,
                            uint16_t color, int size, FontType font) {
    int w = getTextWidth(text, size, font);
    int x = xRight - w;

    if (font == FONT_BIG) drawStringBig(x, y, text, color, size);
    else drawStringCustom(x, y, text, color, size);
}

static void drawFrame() {
    tft.fillScreen(MOD_BG);
    tft.drawRect(0, 0, 320, 240, MOD_LINE);
    tft.drawFastHLine(0, 34, 320, MOD_LINE);
    tft.drawFastHLine(0, 206, 320, MOD_LINE);
}

static void drawMainHeader() {
    tft.fillRect(1, 1, 318, 32, MOD_BG);
    drawStringBig(10, 8, "ESP32 TOOLS", MOD_TEXT, 1);
    drawStringCustom(128, 13, "MAIN MENU", MOD_GLOW, 1);

    String count = String(currentEntry + 1) + "/" + String(MAIN_COUNT);
    drawBitmapRight(306, 12, count, MOD_TEXT, 1, FONT_SMALL);

    tft.drawRect(236, 24, 70, 5, MOD_GLOW);
    int fillW = ((currentEntry + 1) * 68) / MAIN_COUNT;
    if (fillW > 0) tft.fillRect(237, 25, fillW, 3, MOD_TEXT);
}

static void drawMainFooter() {
    tft.fillRect(1, 207, 318, 32, MOD_BG);
    drawStringCustom(10, 218, "UP/DN/ENC: SELECT", MOD_TEXT, 1);
    drawBitmapRight(310, 218, "OK: OPEN", MOD_TEXT, 1, FONT_SMALL);
}

static void clearMainArea() {
    tft.fillRect(1, 35, 318, 171, MOD_BG);
}

static void drawGlowBox(int x, int y, int w, int h) {
    tft.drawRect(x - 2, y - 2, w + 4, h + 4, MOD_GLOW_2);
    tft.drawRect(x - 1, y - 1, w + 2, h + 2, MOD_GLOW);
    tft.drawRect(x, y, w, h, MOD_TEXT);
}

static void drawWifiIcon(int cx, int cy, uint16_t color, uint16_t accent) {
    tft.drawRect(cx - 10, cy + 5, 20, 7, color);
    tft.fillCircle(cx - 5, cy + 8, 1, accent);
    tft.fillCircle(cx + 5, cy + 8, 1, accent);

    tft.drawLine(cx - 11, cy - 1, cx - 6, cy - 6, color);
    tft.drawLine(cx - 6, cy - 6, cx + 6, cy - 6, color);
    tft.drawLine(cx + 6, cy - 6, cx + 11, cy - 1, color);
    tft.drawLine(cx - 6, cy + 2, cx - 3, cy - 1, accent);
    tft.drawLine(cx - 3, cy - 1, cx + 3, cy - 1, accent);
    tft.drawLine(cx + 3, cy - 1, cx + 6, cy + 2, accent);
}

static void drawRadioIcon(int cx, int cy, uint16_t color, uint16_t accent) {
    tft.drawFastHLine(cx - 14, cy + 13, 28, color);
    for (int i = 0; i < 5; i++) {
        int h = 6 + i * 3;
        int x = cx - 13 + i * 6;
        tft.fillRect(x, cy + 12 - h, 3, h, (i == 3) ? accent : color);
    }
    tft.drawCircle(cx + 12, cy - 7, 5, color);
    tft.fillCircle(cx + 12, cy - 7, 2, accent);
}

