pepeangell5/CYBERDECK-MINI-ESP32-V2/src/MenuSystem.cpp
static void drawBluetoothIcon(int cx, int cy, uint16_t color, uint16_t accent) {
    tft.drawLine(cx, cy - 12, cx, cy + 12, color);
    tft.drawLine(cx, cy - 12, cx + 9, cy - 4, color);
    tft.drawLine(cx + 9, cy - 4, cx - 7, cy + 9, color);
    tft.drawLine(cx, cy + 12, cx + 9, cy + 4, color);
    tft.drawLine(cx + 9, cy + 4, cx - 7, cy - 9, color);
    tft.fillCircle(cx, cy, 2, accent);
}

static void drawMonitorIcon(int cx, int cy, uint16_t color, uint16_t accent) {
    tft.drawRect(cx - 15, cy - 12, 30, 20, color);
    tft.drawLine(cx - 11, cy, cx - 5, cy, color);
    tft.drawLine(cx - 5, cy, cx - 2, cy - 6, accent);
    tft.drawLine(cx - 2, cy - 6, cx + 3, cy + 5, accent);
    tft.drawLine(cx + 3, cy + 5, cx + 7, cy - 2, color);
    tft.drawLine(cx + 7, cy - 2, cx + 12, cy - 2, color);
    tft.drawFastVLine(cx, cy + 8, 5, color);
    tft.drawFastHLine(cx - 8, cy + 13, 16, color);
}

static void drawSystemIcon(int cx, int cy, uint16_t color, uint16_t accent) {
    tft.drawCircle(cx, cy, 8, color);
    tft.drawCircle(cx, cy, 4, accent);
    tft.drawFastHLine(cx - 13, cy, 5, color);
    tft.drawFastHLine(cx + 8, cy, 5, color);
    tft.drawFastVLine(cx, cy - 13, 5, color);
    tft.drawFastVLine(cx, cy + 8, 5, color);
    tft.drawLine(cx - 8, cy - 8, cx - 11, cy - 11, color);
    tft.drawLine(cx + 8, cy - 8, cx + 11, cy - 11, color);
    tft.drawLine(cx - 8, cy + 8, cx - 11, cy + 11, color);
    tft.drawLine(cx + 8, cy + 8, cx + 11, cy + 11, color);
}

static void drawVectorIcon(IconID id, int cx, int cy, uint16_t color,
                           uint16_t accent) {
    tft.drawCircle(cx, cy, 13, color);
    tft.drawCircle(cx, cy, 11, accent);

    switch (id) {
        case ICON_WIFI:      drawWifiIcon(cx, cy, color, accent);      break;
        case ICON_RADIO:     drawRadioIcon(cx, cy, color, accent);     break;
        case ICON_BLUETOOTH: drawBluetoothIcon(cx, cy, color, accent); break;
        case ICON_MONITOR:   drawMonitorIcon(cx, cy, color, accent);   break;
        case ICON_SYSTEM:
        default:             drawSystemIcon(cx, cy, color, accent);    break;
    }
}

static void drawHeroWifi(int cx, int cy, uint16_t color, uint16_t accent) {
    tft.drawRect(cx - 25, cy + 18, 50, 14, color);
    tft.drawFastHLine(cx - 20, cy + 24, 40, accent);
    tft.fillCircle(cx - 13, cy + 25, 2, accent);
    tft.fillCircle(cx + 13, cy + 25, 2, accent);

    tft.drawLine(cx - 34, cy + 8, cx - 20, cy - 6, color);
    tft.drawLine(cx - 20, cy - 6, cx + 20, cy - 6, color);
    tft.drawLine(cx + 20, cy - 6, cx + 34, cy + 8, color);
    tft.drawLine(cx - 24, cy + 9, cx - 13, cy - 1, accent);
    tft.drawLine(cx - 13, cy - 1, cx + 13, cy - 1, accent);
    tft.drawLine(cx + 13, cy - 1, cx + 24, cy + 9, accent);
}

static void drawHeroRadio(int cx, int cy, uint16_t color, uint16_t accent) {
    tft.drawFastHLine(cx - 28, cy + 26, 56, color);
    for (int i = 0; i < 7; i++) {
        int h = 10 + (i % 4) * 8;
        int x = cx - 25 + i * 8;
        tft.fillRect(x, cy + 25 - h, 4, h, (i == 4) ? accent : color);
    }
    tft.drawCircle(cx + 27, cy - 18, 10, color);
    tft.drawCircle(cx + 27, cy - 18, 16, accent);
    tft.fillCircle(cx + 27, cy - 18, 3, accent);
}

static void drawHeroBluetooth(int cx, int cy, uint16_t color, uint16_t accent) {
    tft.drawLine(cx, cy - 34, cx, cy + 34, color);
    tft.drawLine(cx, cy - 34, cx + 26, cy - 12, color);
    tft.drawLine(cx + 26, cy - 12, cx - 20, cy + 24, color);
    tft.drawLine(cx, cy + 34, cx + 26, cy + 12, color);
    tft.drawLine(cx + 26, cy + 12, cx - 20, cy - 24, color);
    tft.fillCircle(cx, cy, 5, accent);
    tft.drawCircle(cx, cy, 10, accent);
}

static void drawHeroMonitor(int cx, int cy, uint16_t color, uint16_t accent) {
    tft.drawRect(cx - 36, cy - 26, 72, 48, color);
    tft.drawRect(cx - 31, cy - 21, 62, 36, color);
    tft.drawLine(cx - 26, cy, cx - 14, cy, color);
    tft.drawLine(cx - 14, cy, cx - 8, cy - 14, accent);
    tft.drawLine(cx - 8, cy - 14, cx + 4, cy + 12, accent);
    tft.drawLine(cx + 4, cy + 12, cx + 13, cy - 7, color);
    tft.drawLine(cx + 13, cy - 7, cx + 26, cy - 7, color);
    tft.drawFastVLine(cx, cy + 22, 10, color);
    tft.drawFastHLine(cx - 18, cy + 32, 36, color);
}

static void drawHeroSystem(int cx, int cy, uint16_t color, uint16_t accent) {
    tft.drawCircle(cx, cy, 25, color);
    tft.drawCircle(cx, cy, 12, accent);
    tft.drawFastHLine(cx - 42, cy, 17, color);
    tft.drawFastHLine(cx + 25, cy, 17, color);
    tft.drawFastVLine(cx, cy - 42, 17, color);
    tft.drawFastVLine(cx, cy + 25, 17, color);
    tft.drawLine(cx - 26, cy - 26, cx - 36, cy - 36, color);
    tft.drawLine(cx + 26, cy - 26, cx + 36, cy - 36, color);
    tft.drawLine(cx - 26, cy + 26, cx - 36, cy + 36, color);
    tft.drawLine(cx + 26, cy + 26, cx + 36, cy + 36, color);
    tft.fillCircle(cx, cy, 4, accent);
}

static void drawHeroIcon(IconID id, int cx, int cy, uint16_t color,
                         uint16_t accent) {
    tft.drawCircle(cx, cy, 43, MOD_GLOW_2);
    tft.drawCircle(cx, cy, 40, MOD_GLOW);
    tft.drawCircle(cx, cy, 36, MOD_TEXT);

    switch (id) {
        case ICON_WIFI:      drawHeroWifi(cx, cy, color, accent);      break;
        case ICON_RADIO:     drawHeroRadio(cx, cy, color, accent);     break;
        case ICON_BLUETOOTH: drawHeroBluetooth(cx, cy, color, accent); break;
        case ICON_MONITOR:   drawHeroMonitor(cx, cy, color, accent);   break;
        case ICON_SYSTEM:
        default:             drawHeroSystem(cx, cy, color, accent);    break;
    }
}

static void drawMainRow(int idx, bool selected, bool pressed) {
    if (idx < 0 || idx >= MAIN_COUNT) return;

    const MainMenuEntry& e = MAIN_ENTRIES[idx];
    int y = MENU_TOP + idx * ROW_H;
    uint16_t bg = pressed ? MOD_TEXT : MOD_BG;
    uint16_t fg = pressed ? MOD_INVERT : MOD_TEXT;
    uint16_t accent = selected ? MOD_GLOW : MOD_TEXT;

    tft.fillRect(ROW_X - 3, y - 3, ROW_W + 6, ROW_BOX_H + 6, MOD_BG);
    tft.fillRect(ROW_X, y, ROW_W, ROW_BOX_H, bg);

    if (selected) {
        drawGlowBox(ROW_X, y, ROW_W, ROW_BOX_H);
    } else {
        tft.drawRect(ROW_X, y, ROW_W, ROW_BOX_H, MOD_LINE);
    }

    drawVectorIcon(e.icon, 26, y + 14, fg, accent);
    drawStringBig(48, y + 4, e.title, fg, 1);
    drawStringCustom(48, y + 19, e.subtitle, fg, 1);

    String idxText = "0" + String(idx + 1);
    drawBitmapRight(151, y + 10, idxText, fg, 1, FONT_SMALL);
}

static void drawPreviewPanel(bool pressed) {
    if (currentEntry < 0 || currentEntry >= MAIN_COUNT) return;
    const MainMenuEntry& e = MAIN_ENTRIES[currentEntry];
    uint16_t panelBg = pressed ? MOD_TEXT : MOD_BG;
    uint16_t fg = pressed ? MOD_INVERT : MOD_TEXT;
    uint16_t accent = pressed ? MOD_INVERT : MOD_GLOW;

    tft.fillRect(PREVIEW_X - 3, PREVIEW_Y - 3,
                 PREVIEW_W + 6, PREVIEW_H + 6, MOD_BG);
    tft.fillRect(PREVIEW_X, PREVIEW_Y, PREVIEW_W, PREVIEW_H, panelBg);
    drawGlowBox(PREVIEW_X, PREVIEW_Y, PREVIEW_W, PREVIEW_H);

    drawHeroIcon(e.icon, PREVIEW_X + PREVIEW_W / 2, PREVIEW_Y + 56, fg, accent);
    drawBitmapCenteredIn(PREVIEW_X, PREVIEW_W, PREVIEW_Y + 112,
                         e.title, fg, 1, FONT_BIG);
    drawBitmapCenteredIn(PREVIEW_X, PREVIEW_W, PREVIEW_Y + 132,
                         e.subtitle, fg, 1, FONT_SMALL);
    drawBitmapCenteredIn(PREVIEW_X, PREVIEW_W, PREVIEW_Y + 146,
                         "OK TO OPEN", fg, 1, FONT_SMALL);
}

static void drawAllMainRows() {
    tft.fillRect(1, 35, 164, 171, MOD_BG);
    for (int i = 0; i < MAIN_COUNT; i++) {
        drawMainRow(i, i == currentEntry, false);
    }
}

