pepeangell5/CYBERDECK-MINI-ESP32-V2/src/MenuSystem.cpp
static void redrawMainMenu(bool pressed = false) {
    drawFrame();
    drawMainHeader();
    drawMainFooter();
    if (pressed) {
        drawAllMainRows();
        drawMainRow(currentEntry, true, true);
        drawPreviewPanel(true);
    } else {
        drawAllMainRows();
        drawPreviewPanel(false);
    }
}

static void changeMainEntry(int nextEntry, bool updatePreview = true) {
    int oldEntry = currentEntry;
    currentEntry = nextEntry;
    tft.startWrite();
    drawMainRow(oldEntry, false, false);
    drawMainRow(currentEntry, true, false);
    if (updatePreview) drawPreviewPanel(false);
    drawMainHeader();
    tft.endWrite();
}

static void handlerWifi() {
    static const char* wifiItems[] = {
        "WiFi Scanner",
        "Threat Monitor",
        "WiFi Audit",
        "Beacon Spam",
        "Deauther",
        "Evil Portal",
        "Probe Sniffer",
        "KARMA Attack"
    };

    bool exitSub = false;
    while (!exitSub) {
        int choice = runSubMenu("WIFI TOOLS", wifiItems,
                                sizeof(wifiItems) / sizeof(char*));
        switch (choice) {
            case -1: exitSub = true;    break;
            case  0: runWifiScan();     break;
            case  1: runThreatMonitor(); break;
            case  2: runWifiAudit();    break;
            case  3: runBeaconSpam();   break;
            case  4: runDeauther();     break;
            case  5: runEvilPortal();   break;
            case  6: runProbeSniffer(); break;
            case  7: runKarma();        break;
        }
    }
}

static void handlerRadio() {
    static const char* radioItems[] = {
        "Jammer",
        "Spectrum",
        "RF Baseline",
        "NRF Diagnostic"
    };

    bool exitSub = false;
    while (!exitSub) {
        int choice = runSubMenu("RADIO TOOLS", radioItems,
                                sizeof(radioItems) / sizeof(char*));
        switch (choice) {
            case -1: exitSub = true;       break;
            case  0: runRadioJammer();     break;
            case  1: runRadioScanner();    break;
            case  2: runRfBaseline();      break;
            case  3: runNRFDiagnostics();  break;
        }
    }
}

static void handlerBT() {
    static const char* btItems[] = {
        "BLE Defense",
        "BLE Scanner",
        "BLE Spam",
        "BT Disruptor",
        "BT Jammer"
    };

    bool exitSub = false;
    while (!exitSub) {
        int choice = runSubMenu("BLUETOOTH", btItems,
                                sizeof(btItems) / sizeof(char*));
        switch (choice) {
            case -1: exitSub = true;   break;
            case  0: runBLEAudit();    break;
            case  1: runBLEScanner();  break;
            case  2: runBLESpam();     break;
            case  3: runBTDisruptor(); break;
            case  4: runBTJammer();    break;
        }
    }
}

static void handlerMonitor() {
    runPacketMonitor();
}

static void handlerSystem() {
    static const char* systemItems[] = {
        "Mission Dash",
        "Audit Reports",
        "Settings",
        "System Info",
        "NRF Diagnostic",
        "GPS Tools",
        "MicroSD Manager",
        "MicroSD Info",
        "Battery ADC",
        "Clock & Weather",
        "About"
    };

    bool exitSub = false;
    while (!exitSub) {
        int choice = runSubMenu("SYSTEM", systemItems,
                                sizeof(systemItems) / sizeof(char*));
        switch (choice) {
            case -1: exitSub = true;      break;
            case  0: runMissionDashboard(); break;
            case  1: runAuditReports();   break;
            case  2: runSettings();       break;
            case  3: runSystemInfo();     break;
            case  4: runNRFDiagnostics(); break;
            case  5: runGpsTools();       break;
            case  6: runSdFileBrowser();  break;
            case  7: runSdStatus();       break;
            case  8: runBatteryStatus();  break;
            case  9: runClockWeather();   break;
            case 10: runAbout();          break;
        }
    }
}

void runMainMenu() {
    redrawMainMenu(false);

    unsigned long lastPress = 0;
    unsigned long lastActivity = millis();
    bool previewDirty = false;

    while (true) {
        NavAction action = readNavAction(80);

        if (action == NAV_UP && (millis() - lastPress > 55)) {
            int prev = (currentEntry - 1 + MAIN_COUNT) % MAIN_COUNT;
            beep(2200, 25);
            changeMainEntry(prev, false);
            previewDirty = true;
            lastPress = millis();
            lastActivity = millis();
        }

        if (action == NAV_DOWN && (millis() - lastPress > 55)) {
            int next = (currentEntry + 1) % MAIN_COUNT;
            beep(2200, 25);
            changeMainEntry(next, false);
            previewDirty = true;
            lastPress = millis();
            lastActivity = millis();
        }

        if (previewDirty && millis() - lastPress > 75) {
            tft.startWrite();
            drawPreviewPanel(false);
            tft.endWrite();
            previewDirty = false;
        }

        if (action == NAV_ENTER && (millis() - lastPress > 220)) {
            if (previewDirty) {
                tft.startWrite();
                drawPreviewPanel(false);
                tft.endWrite();
                previewDirty = false;
            }
            tft.startWrite();
            drawMainRow(currentEntry, true, true);
            tft.endWrite();

            beep(1800, 40);
            delay(80);
            while (isEnterPressed() || isBackPressed()) delay(5);

            MAIN_ENTRIES[currentEntry].handler();

            redrawMainMenu(false);
            previewDirty = false;
            lastPress = millis();
            lastActivity = millis();
        }

        if (millis() - lastActivity > SCREENSAVER_IDLE_MS) {
            runScreensaver();
            redrawMainMenu(false);
            previewDirty = false;
            lastActivity = millis();
            lastPress = millis();
        }

        delay(10);
    }
}

int runSubMenu(const char* title, const char* items[], int count) {
    const int VISIBLE = 5;
    const int LINE_H = 30;
    const int LIST_Y = 50;

