pepeangell5/CYBERDECK-MINI-ESP32-V2/src/MenuSystem.cpp
    if (count <= 0) return -1;

    int totalItems = count;
    SubMenuState* state = stateForSubMenu(title);
    int cursor = state->cursor;
    int scrollOffset = state->scrollOffset;
    int result = -2;
    unsigned long lastPress = 0;

    if (cursor < 0) cursor = 0;
    if (cursor >= totalItems) cursor = totalItems - 1;

    int maxScroll = totalItems > VISIBLE ? totalItems - VISIBLE : 0;
    if (scrollOffset < 0) scrollOffset = 0;
    if (scrollOffset > maxScroll) scrollOffset = maxScroll;
    if (cursor < scrollOffset) scrollOffset = cursor;
    if (cursor >= scrollOffset + VISIBLE) scrollOffset = cursor - VISIBLE + 1;

    auto rememberPosition = [&]() {
        state->cursor = cursor;
        state->scrollOffset = scrollOffset;
    };

    auto drawHeaderFooter = [&]() {
        drawFrame();
        drawStringBig(12, 8, title, MOD_TEXT, 1);
        drawBitmapRight(306, 13, String(count) + " ITEMS", MOD_TEXT, 1, FONT_SMALL);
        drawStringCustom(10, 218, "UP/DN: MOVE", MOD_TEXT, 1);
        drawBitmapRight(310, 218, "OK:HOLD BACK", MOD_TEXT, 1, FONT_SMALL);
    };

    auto drawItem = [&](int idx, int row, bool selected) {
        if (row < 0 || row >= VISIBLE) return;

        int y = LIST_Y + row * LINE_H;
        uint16_t bg = selected ? MOD_TEXT : MOD_BG;
        uint16_t fg = selected ? MOD_INVERT : MOD_TEXT;
        String label = String(items[idx]);

        tft.fillRect(10, y - 5, 300, LINE_H - 3, bg);
        tft.drawRect(10, y - 5, 300, LINE_H - 3, MOD_LINE);
        drawStringCustom(22, y + 2, label, fg, 2);
    };

    auto drawScrollBar = [&]() {
        tft.fillRect(313, 42, 3, 162, MOD_BG);
        if (totalItems <= VISIBLE) return;

        int barH = (VISIBLE * 162) / totalItems;
        int barY = 42 + (scrollOffset * (162 - barH)) / (totalItems - VISIBLE);
        tft.fillRect(313, barY, 3, barH, MOD_TEXT);
    };

    auto drawVisible = [&]() {
        for (int row = 0; row < VISIBLE; row++) {
            int idx = scrollOffset + row;
            if (idx < totalItems) {
                drawItem(idx, row, idx == cursor);
            } else {
                int y = LIST_Y + row * LINE_H;
                tft.fillRect(10, y - 5, 300, LINE_H - 3, MOD_BG);
            }
        }
        drawScrollBar();
    };

    auto redrawMove = [&](int oldCursor, int oldScrollOffset) {
        if (oldScrollOffset != scrollOffset) {
            drawVisible();
            return;
        }

        int oldRow = oldCursor - scrollOffset;
        int newRow = cursor - scrollOffset;
        if (oldRow >= 0 && oldRow < VISIBLE) {
            drawItem(oldCursor, oldRow, false);
        }
        if (newRow >= 0 && newRow < VISIBLE) {
            drawItem(cursor, newRow, true);
        }
        drawScrollBar();
    };

    while (isEnterPressed() || isBackPressed()) delay(5);
    delay(80);
    flushNavInput();

    tft.startWrite();
    drawHeaderFooter();
    drawVisible();
    tft.endWrite();

    while (result == -2) {
        NavAction action = readNavAction(60);

        if (action == NAV_UP && (millis() - lastPress > 45)) {
            int oldCursor = cursor;
            int oldScrollOffset = scrollOffset;
            cursor = (cursor - 1 + totalItems) % totalItems;
            if (cursor < scrollOffset) scrollOffset = cursor;
            if (cursor >= scrollOffset + VISIBLE) scrollOffset = cursor - VISIBLE + 1;
            rememberPosition();

            beep(2200, 15);
            tft.startWrite();
            redrawMove(oldCursor, oldScrollOffset);
            tft.endWrite();
            lastPress = millis();
        }

        if (action == NAV_DOWN && (millis() - lastPress > 45)) {
            int oldCursor = cursor;
            int oldScrollOffset = scrollOffset;
            cursor = (cursor + 1) % totalItems;
            if (cursor < scrollOffset) scrollOffset = cursor;
            if (cursor >= scrollOffset + VISIBLE) scrollOffset = cursor - VISIBLE + 1;
            rememberPosition();

            beep(2200, 15);
            tft.startWrite();
            redrawMove(oldCursor, oldScrollOffset);
            tft.endWrite();
            lastPress = millis();
        }

        if (action == NAV_BACK) {
            rememberPosition();
            beep(1000, 40);
            result = -1;
            lastPress = millis();
        }

        if (action == NAV_ENTER && (millis() - lastPress > 180)) {
            bool held = waitOkReleaseWasLong();
            rememberPosition();
            beep(held ? 1000 : 1500, 40);
            result = held ? -1 : cursor;
            lastPress = millis();
        }

        delay(4);
    }

    while (isEnterPressed() || isBackPressed()) delay(5);
    delay(60);

    rememberPosition();
    return result;
}
